Revit 2027 API
IFCLogical Enumeration
 A datatype can have values TRUE, FALSE, UNKNOWN or UNSET.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum IFCLogical
Public Enumeration IFCLogical
public enum class IFCLogical
type IFCLogical
Members
Member name | Value | Description
False | 0 |  False.
True | 2 |  True.
Unknown | 1 |  Unknown.
Unset | 3 |  Unset.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace